[
  {
    "id": 1,
    "stage": "Подготовка",
    "title": "Создать специальную почту Gmail",
    "xp": 20,
    "description": "Создайте новый аккаунт Gmail специально для поступления. Используйте имя и фамилию как в загранпаспорте. Это поможет избежать путаницы и потери важных писем от университетов и визовых центров.",
    "deadline": "2025-11-10",
    "links_to_document_id": null,
    "submission_type": "credentials",
    "submission_fields": [
      { "key": "email", "label": "Логин (email)" },
      { "key": "password", "label": "Пароль" }
    ]
  },
  {
    "id": 2,
    "stage": "Подготовка",
    "title": "Создать папку в облаке и настроить резервные копии",
    "xp": 20,
    "description": "Ваш цифровой архив — залог спокойствия. План действий:\n\n1. **Выберите сервис:** Google Drive или Dropbox отлично подойдут.\n2. **Создайте главную папку:** Назовите ее, например, «Документы для поступления 2026».\n3. **Организуйте структуру:** Внутри создайте подпапки: «Паспорт», «Образование», «Сертификаты», «Фото» и т.д. Это сэкономит вам массу времени в будущем.",
    "deadline": "2025-10-30",
    "links_to_document_id": null,
    "submission_type": "link",
    "submission_label": "Ссылка на папку в облаке"
  },
  {
    "id": 10,
    "stage": "Личные документы",
    "title": "Сфотографировать и загрузить загранпаспорт",
    "xp": 30,
    "description": "Сделайте качественный цветной скан или фотографию главного разворота вашего загранпаспорта. Убедитесь, что все данные хорошо читаемы, нет бликов и пальцев в кадре.",
    "deadline": "2025-11-20",
    "links_to_document_id": 101,
    "submission_type": "file",
    "submission_label": "Файл загранпаспорта"
  },
  {
    "id": 11,
    "stage": "Личные документы",
    "title": "Сделать фото как на паспорт",
    "xp": 30,
    "description": "Сделайте цифровую фотографию паспортного формата (обычно 3.5x4.5 см) на светлом фоне. Она понадобится для анкет и студенческого билета.",
    "deadline": "2025-11-25",
    "links_to_document_id": 102,
    "submission_type": "file",
    "submission_label": "Файл с фотографией"
  },
  {
    "id": 12,
    "stage": "Личные документы",
    "title": "Собрать школьные документы с апостилем и переводом",
    "xp": 50,
    "description": "Это многоступенчатый квест, который требует последовательности. Вот ваш план действий:\n\n**1. Подготовка оригинала:** Убедитесь, что у вас на руках есть оригинал школьного аттестата и приложение с оценками.\n**2. Проставление Апостиля:** Обратитесь в региональный Департамент (или Министерство) Образования. Именно они уполномочены ставить апостиль на образовательные документы. Уточните их график приема и необходимые документы (обычно паспорт и заявление).\n**3. Нотариальный перевод:** После получения документа с апостилем, найдите присяжного или аккредитованного переводчика. Важно, чтобы перевод был выполнен профессионалом, а затем нотариально заверен. Переводится как сам документ, так и штамп апостиля.",
    "deadline": "2025-12-15",
    "links_to_document_id": 201,
    "submission_type": "file",
    "submission_label": "PDF-файл аттестата с апостилем и переводом"
  },
  {
    "id": 13,
    "stage": "Личные документы",
    "title": "Собрать документы колледжа с апостилем и переводом",
    "xp": 50,
    "description": "Процесс для диплома колледжа или техникума полностью повторяет квест со школьным аттестатом. План действий тот же:\n\n**1. Подготовка оригинала:** Возьмите оригинал диплома и приложение к нему.\n**2. Проставление Апостиля:** Найдите ваш региональный Департамент (Министерство) Образования. Они поставят апостиль на диплом, подтвердив его легальность для использования за границей.\n**3. Нотариальный перевод:** С готовым апостилем обратитесь к аккредитованному переводчику для выполнения нотариально заверенного перевода на язык целевой страны.",
    "deadline": "2025-12-15",
    "links_to_document_id": 301,
    "submission_type": "file",
    "submission_label": "PDF-файл диплома с апостилем и переводом"
  },
  {
    "id": 20,
    "stage": "Экзамены",
    "title": "Зарегистрироваться и сдать IELTS Academic",
    "xp": 80,
    "description": "Это важный экзамен, подтверждающий ваше владение английским языком. План действий:\n\n**1. Поиск центра:** Найдите официальный центр сдачи IELTS в вашем городе (например, на сайтах British Council или IDP).\n**2. Регистрация:** Выберите тип экзамена 'Academic' и зарегистрируйтесь на удобную для вас дату. Места могут заканчиваться, поэтому делайте это заранее.\n**3. Подготовка:** Используйте официальные материалы для подготовки, чтобы ознакомиться с форматом и типами заданий. Цельтесь в балл не ниже 6.5, если иное не указано университетом.",
    "deadline": "2026-01-30",
    "links_to_document_id": 401,
    "submission_type": "file",
    "submission_label": "Сертификат IELTS"
  },
  {
    "id": 21,
    "stage": "Экзамены",
    "title": "Зарегистрироваться и сдать экзамен TOLC-I",
    "xp": 100,
    "description": "TOLC-I — это ключ к инженерным и научным факультетам в Италии. Ваш план:\n\n**1. Регистрация на CISIA:** Зайдите на официальный сайт CISIA Online, создайте аккаунт и выберите тип теста 'TOLC-I'.\n**2. Выбор даты и формата:** Вы можете выбрать сдачу онлайн (TOLC@CASA) или в аккредитованном центре. Выберите удобный слот.\n**3. Изучение структуры:** Экзамен состоит из секций: Математика, Логика, Науки и Понимание текста. Ознакомьтесь с темами и примерами заданий на сайте CISIA, чтобы эффективно подготовиться.",
    "deadline": "2026-02-20",
    "links_to_document_id": 402,
    "submission_type": "file",
    "submission_label": "Результаты TOLC-I"
  },
  {
    "id": 30,
    "stage": "Творческие документы",
    "title": "Подготовить CV и мотивационное письмо",
    "xp": 60,
    "description": "Эти документы — ваше лицо перед приемной комиссией. Следуйте этому плану:\n\n**1. Резюме (CV):** Используйте стандартный европейский формат 'Europass'. Это онлайн-конструктор, который поможет вам правильно структурировать информацию: образование, опыт работы (если есть), навыки, языки.\n**2. Мотивационное письмо:** Напишите универсальный шаблон (около 500 слов), где вы рассказываете о себе, своих академических целях и почему вы выбрали эту специальность. Этот шаблон вы будете адаптировать под требования каждого конкретного университета.",
    "deadline": "2026-02-10",
    "links_to_document_id": 501,
    "submission_type": "file",
    "submission_label": "Файл с CV и письмом"
  }
]
